# Curve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevolvedFace..::..Curve Property
RevolvedFace Class See Also
---
Profile curve of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve Curve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Curve As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ Curve {
	Curve^ get ();
}
```

# See Also
RevolvedFace Class
Autodesk.Revit.DB Namespace